In [243]:
def call1(a, b, c):
    print(a,b,c)

In [244]:
call1(10, 20, 30) #위치 매개변수

10 20 30

In [245]:
def call2(a, b, c=50):
    print(a,b,c)

In [246]:
call2(10, 20, 30)

10 20 30

In [247]:
call2(10, 20) #default 기본 매개변수

10 20 50

In [248]:
# default 매개변수는 반드시 뒤에다 위치시켜야한다.
# def call(a=10, b, c) ## 오류!!
def call3(a, b=50, c=100):
        print(a,b,c)

In [249]:
call3(10)

10 50 100

In [250]:
def call4(a, b, c):
    print(a, b, c)

In [251]:
call4(a=100, c=200, b=333) #키워드 파라메터, 순서상관x

100 333 200

In [252]:
## 파이썬은 오버라이딩은 지원, 오버로딩은 지원x
## 오버라이딩(재정의): 상속했을 때 자식클래스의 함수를 재정의하여 기능을 변경
## 오버로딩(다형성): 하나의 이름으로 다양한 형태를 구현할 수 있는 기능
## 자바는 하나의 함수 이름으로 다양한 입력값의 형태를 정의 가능
## public void add(int x, int y)
##public void add(int x)
## 파이썬은 오버로딩 불가능
## 입력값으로 튜플과 딕셔너리를 여러개 넣을 수 있기 때문에
## 파이썬의 함수 입력 값은 0~무한대의 개수를 가지게 정의할 수 있다.
## 가변 매개변수라고 부른다.

In [253]:
def call5(*a, b):
    print(a)
    print(b)

In [254]:
# call5((1,2,3,),5) 에러!

In [255]:
# python.exe 프로그램이 한 줄을 읽어서 실행을 바로 해준다.
# 번역기

In [256]:
call5((1,2,3,),b=5) #위치 가변 매개변수는 보통 단독으로 많이 쓰임
# 위치 가변 매개변수를 쓸 때는 다른 매개변수는 키워드(파라미터명)를 반드시 써주어야 헷갈리지 않는다.

((1, 2, 3),)
5

In [257]:
def call6(*a):
    print(a)

In [258]:
call6(1,2,3,4,5)
# 파이썬에서는 파라미터의 개수가 정확히 몇 개인지 확인하려면
# 함수의 정의를 보고 확인해야한다.(shift + tab)

(1, 2, 3, 4, 5)

In [259]:
call6((1,2,3,4,5),(6,7,8)) # 위치 가변 매개변수는 튜플의 튜플도 가능

((1, 2, 3, 4, 5), (6, 7, 8))

In [260]:
call6((1,2,3,4,5), {'name':'hong'})
# 위치 가변 매개변수는 혼합된 형태도 가능
# 무조건 입력값을 튜플로 묶음

((1, 2, 3, 4, 5), {'name': 'hong'})

In [261]:
def call7(**kwargs):
    print(kwargs)

In [262]:
call7(name='hong', age=100) #키워드 가변 매개변수

{'name': 'hong', 'age': 100}

In [263]:
call7(name='hong') #키워드 가변 매개변수

{'name': 'hong'}

In [264]:
call7(name='hong', age=100, tel='010') #키워드 가변 매개변수

{'name': 'hong', 'age': 100, 'tel': '010'}

In [265]:
def call8(*tags, title, content, **kwargs):
    print('tag>>',tags)
    print('title>>',title)
    print('content>>',content)
    print('kwargs>>',kwargs)

In [266]:
## 가변 변수와 함께 쓰는 일반 변수는 키워드 변수로 사용해야한다.
## 변수명과 함께 써주어야 한다.

In [267]:
call8('바다', '휴양지', '쉼', title='제주도여행', content='해수욕장으로 고고!', 
     location='제주도 북동부', move='날아서')

tag>> ('바다', '휴양지', '쉼')
title>> 제주도여행
content>> 해수욕장으로 고고!
kwargs>> {'location': '제주도 북동부', 'move': '날아서'}

In [268]:
## 람다함수

In [269]:
def call9(a):
    b=a-1
    return b

In [270]:
## 일반 함수의 4대 조건
## 함수 이름(입력값): call9(a)
## 함수 처리 내용(a-1)
## 함수 처리 결과 리턴값(b)

## 람다 함수의 3대 조건
## (입력값):
## 함수 처리 내용
## 함수 처리 결과 리턴값

In [271]:
#[list comprehension] => 익명함수의 일종

In [272]:
# lambda => 익명함수의 일종
lambda a:a-1

In [273]:
(lambda a:a-1)(10)

9

In [274]:
a_fun=lambda a:a-1

In [275]:
a_fun(10)

9

In [276]:
lambda a:True if a>0 else False

In [277]:
(lambda a:True if a>0 else False)(10)

True

In [278]:
true_fun=lambda a:True if a>0 else False

In [279]:
true_fun(10)

True

In [280]:
# 입력값이 양수이면 1, 음수이면 0
digit_fun=lambda a:1 if a>0 else (0 if a<0 else -1)

In [281]:
digit_fun(1)

1

In [282]:
digit_fun(1)

1

In [283]:
## 입력값을 2개 넣어, 더해보세요.
plus_fun=lambda a,b:a+b

In [284]:
plus_fun(10,20)

30

In [285]:
## 입력값이 2개의 리스트가 되도록 해보세요.

In [286]:
list_fun=lambda a,b:[a,b]

In [287]:
list_fun(10, 30)

[10, 30]

In [288]:
## one_fun, one_fun2를 일반 함수로 변경해보세요.

In [289]:
## 데이터 분석에 있어서 핵심은 df
## 람다를 df를 다룰 때 어떻게 사용해야 하는가?

In [290]:
#람다 함수를 사용하는 이유
#1. 메모리에 함수의 원형이 저장되지 않음.
#2. 일반 함수보다 쉽고 간단

In [291]:
lambda x : x + 1 #lambda 입력 파라미터 리스트 : 처리내용(반환)

In [292]:
(lambda x:x+1)(10)

11

In [293]:
add=lambda x:x+1

In [294]:
add(100)

101

In [295]:
list_data=[1,2,3]

In [296]:
map(add, list_data) ##결과가 map객체, 사용할 수 없는 형태
## map 함수는 많은 양의 데이터(리스트 등)를 하나씩 꺼내서 
## 함수를 map시켜 실행시켜준다.
## map 함수의 결과는 무조건 map 객체이므로
## map 함수의 결과를 사용하고자 하는 경우, list로 캐스팅 시켜준다.

In [297]:
list(map(add, list_data)) ##list <--- map객체

[2, 3, 4]

In [298]:
# 입력값이 양수이면, '양수', 음수이면 '음수' 람다 함수를 만들어보세요.
list_data=[10, 20, -30, -40, 50]

In [299]:
fun1=lambda x:"양수" if x>0 else("음수" if x<0 else "0")

In [300]:
result=list(map(fun1,list_data))
result

['양수', '양수', '음수', '음수', '양수']

In [301]:
import pandas as pd
import numpy as np

In [302]:
df1=pd.DataFrame({
    'name':['홍길동', '김길동', '홍순신','정길동', '송사임'],
    'age':[100,200,300,150,250]
})

In [303]:
df1['result']=result

In [304]:
df1

  name  age result
0  홍길동  100     양수
1  김길동  200     양수
2  홍순신  300     음수
3  정길동  150     음수
4  송사임  250     양수

In [305]:
age_lambda=lambda x:'고령' if x>=200 else '보통'

In [306]:
list(map(age_lambda, df1['age'])) ##map(함수, 리스트 형태의 자료구조)

['보통', '고령', '고령', '보통', '고령']

In [307]:
df1['age_result']=list(map(age_lambda, df1['age']))

In [308]:
df1

  name  age result age_result
0  홍길동  100     양수         보통
1  김길동  200     양수         고령
2  홍순신  300     음수         고령
3  정길동  150     음수         보통
4  송사임  250     양수         고령

In [309]:
## 람다 함수를 만들어보세요.
## name에 홍이라는 글자를 포함하고 있으면 1, 아니면 0
## 결과를 name_result 파생변수를 만들어보세요.

In [310]:
list(df1['name'])[0].find('김')

-1

In [311]:
find_hong=lambda x:1 if x.find('홍')>-1 else 0 ## '홍' in x 도 가능

In [312]:
name_result=list(map(find_hong, df1['name']))

In [313]:
df1['name_result']=name_result

In [314]:
df1

  name  age result age_result  name_result
0  홍길동  100     양수         보통            1
1  김길동  200     양수         고령            0
2  홍순신  300     음수         고령            1
3  정길동  150     음수         보통            0
4  송사임  250     양수         고령            0

In [315]:
'홍' in '홍길동' #문자열, in의 결과는 Bool

True

In [316]:
1 in [1,2,3] #in 리스트, 리스트 내에 1을 포함하는지

True

In [317]:
1 not in [1,2,3]

False

In [318]:
## 참석 확인하려고 하는 이름이 '홍길동'
## 참석자 리스트가 '김길동', '박길동', '송길동'
## 포함여부 확인용 ==> in, not in

In [319]:
'홍길동' in ['김길동', '박길동', '송길동']

False

In [320]:
name_list=['김길동', '박길동', '송길동']

In [321]:
name=input('확인하고 싶은 이름을 입력하세요.')

확인하고 싶은 이름을 입력하세요.김길동

In [322]:
if name in name_list:
    print('참석자 명단에 있습니다.')
else:
    print('참석자 명단에 없습니다.')

참석자 명단에 있습니다.

In [323]:
## 일반 함수와 람다 함수로 이름을 넣어서 판단하는 처리를 구현해보세요.

In [324]:
def find_name(name):
    if name in name_list:
        print('참석자 명단에 있습니다.')
    else:
        print('참석자 명단에 없습니다.')

In [325]:
find_name('박길동')

참석자 명단에 있습니다.

In [326]:
lambda_find_name= lambda x:'참석자 명단에 있습니다.' if x in name_list else '참석자 명단에 없습니다.'

In [327]:
lambda_find_name('홍길동')

'참석자 명단에 없습니다.'

In [328]:
## map과 filter비교!!
## map은 true/false의 결과를 모두 다 return
## filter는 true인 경우만 return

In [329]:
list(filter(find_hong, df1['name']))

['홍길동', '홍순신']

In [330]:
# df의 result 변수의 값이 양수이면 1, 음수이면 0으로 바꿔보세요.

In [331]:
df1['result']=list(map(lambda x:1 if x=='양수' else 0,df1['result']))
df1

  name  age  result age_result  name_result
0  홍길동  100       1         보통            1
1  김길동  200       1         고령            0
2  홍순신  300       0         고령            1
3  정길동  150       0         보통            0
4  송사임  250       1         고령            0

In [332]:
# age_result의 값이 고령이면 1, 아니면 0으로 변경해보세요.
# age를 100~200 청년, 200~250 중년, 나머지는 고령

In [333]:
df1['age_result']=list(map(lambda x:1 if x=='고령' else 0, df1['age_result']))

In [334]:
df1

  name  age  result  age_result  name_result
0  홍길동  100       1           0            1
1  김길동  200       1           1            0
2  홍순신  300       0           1            1
3  정길동  150       0           0            0
4  송사임  250       1           1            0

In [335]:
df1['age']=list(map(lambda x:'청년' if (x>=100 and x<200) else('중년' if (x>=200 and x<250) else '고령'), df1['age']))
df1

  name age  result  age_result  name_result
0  홍길동  청년       1           0            1
1  김길동  중년       1           1            0
2  홍순신  고령       0           1            1
3  정길동  청년       0           0            0
4  송사임  고령       1           1            0

In [336]:
## apply 함수(적용시키다.)
## 컬럼명.apply(함수)

In [337]:
df1.columns

Index(['name', 'age', 'result', 'age_result', 'name_result'], dtype='object')

In [338]:
df1['result'].apply(lambda x:x+1) #비파괴

0    2
1    2
2    1
3    1
4    2
Name: result, dtype: int64

In [339]:
df1

  name age  result  age_result  name_result
0  홍길동  청년       1           0            1
1  김길동  중년       1           1            0
2  홍순신  고령       0           1            1
3  정길동  청년       0           0            0
4  송사임  고령       1           1            0

In [340]:
df1['result+1']=df1['result'].apply(lambda x:x+1)
df1

  name age  result  age_result  name_result  result+1
0  홍길동  청년       1           0            1         2
1  김길동  중년       1           1            0         2
2  홍순신  고령       0           1            1         1
3  정길동  청년       0           0            0         1
4  송사임  고령       1           1            0         2

In [341]:
## 일반 함수를 만들어 apply를 적용해보세요.
## 이름의 첫 글자가 송으로 시작하면 '송', 아니면 첫 글자에 해당하는 글자
## 파생 변수 name_apply

In [346]:
def last_name(name):
    return list(name)[0]

In [347]:
last_name('김길동')

'김'

In [348]:
df1['last_name']=df1['name'].apply(last_name)

In [349]:
df1

  name age  result  age_result  name_result  result+1 last_name
0  홍길동  청년       1           0            1         2         홍
1  김길동  중년       1           1            0         2         김
2  홍순신  고령       0           1            1         1         홍
3  정길동  청년       0           0            0         1         정
4  송사임  고령       1           1            0         2         송